Autodesk.Revit.DB.Fabrication.FabricationAncillaryType
An enumerated type listing all fabrication ancillary types.
Since:
2017 Subscription Update
Since:
2017 Subscription Update

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.SeamMaterial
Ancillary seam material.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.Isolator
Ancillary support isolators. Used inline ancillary support rods.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.AirturnVane
Ancillary airturn vanes. Used to manage flow through fittings.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.AirturnTrack
Ancillary airturn tracks. Used to fasten airturn vanes in place.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.AncillaryMaterial
Ancillary materials used to support and externally stiffen fittings, eg. angle iron, unistrut.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.SupportRod
Ancillary support drop rod types. Used to support fittings.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.Sealant
Ancillary sealants. Used to seal seams.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.Gasket
Ancillary gaskets. Used to seal connector joints.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.TieRod
Ancillary tie rod types. Used to internally stiffen fittings.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.Clip
Ancillary clips and washers. Used to additionally fix and clip ancillaries together.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.Corner
Ancillary corner joints. Used to join ancillary materials."

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.Fixing
Ancillary nuts and bolts. Used to fix and bind other ancillaries.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryType.Unknown
Unknown or unsupported ancillary type.